{"name":"Ivern","scraped_data":{"baseData":{"baseStats":{"hp":655,"hp_plus":99,"hp5":7,"hp5_plus":0.85,"mp":450,"mp_plus":60,"mp5":6,"mp5_plus":0.75,"ad":50,"ad_plus":3,"as":0.644,"as_plus":0.034,"ar":27,"ar_plus":4.7,"mr":32,"mr_plus":2.05,"ms":330,"range":475,"windup":23},"abilities":{"0":{"name":"Friend_of_the_Forest","metaData":{},"textContent":{"0":{"text":"Innate: Ivern cannot attack nor damage non-epic  monsters. Instead, targeting a jungle camp initiates a 2.5 second  channel that will plant a grove upon the camp. Placing a grove costs  131 − 70.14 (based on level) health and  135 − 66.15 (based on level) mana. The channel cannot be cancelled in the first 0.15 seconds and in the last 0.5 seconds.","skillTabs":{}},"1":{"text":"Ivern cannot place a grove while he is unable to cast abilities.","skillTabs":{}},"2":{"text":"The grove matures over 40 − 1 (based on level) seconds. When fully matured, Ivern can target the camp again to free it after a 0.5-second cast time, clearing the camp and receiving the  full gold and  full experience bounties. Using  Smite on a monster within the grove will instantly free the camp regardless of maturity.","skillTabs":{}},"3":{"text":"If the camp's large monster has already been slain prior to planting a grove, Ivern will free the camp upon completing the channel at no cost. Similarly, the grove will instantly mature if the large monster is slain.","skillTabs":{}},"4":{"text":"Starting at level 5, freeing the  Red Brambleback or the  Blue Sentinel leaves behind a sapling for 60 seconds that can be gathered by one allied  champion to gain the camp's respective buff, either the  Crest of Cinders or the  Crest of Insight, for a reduced 90 seconds(bug). If an ally kills either monster, they also leave behind a sapling that only Ivern can consume.","skillTabs":{}}}},"1":{"name":"Rootcaller","metaData":{"0":"TARGET RANGE:  1100","1":"WIDTH:  160","2":"SPEED: 1300","3":"CAST TIME: 0.25","4":"COST: 60 MANA","5":"COOLDOWN: 14 / 13 / 12 / 11 / 10"},"textContent":{"0":{"text":"Active: Ivern throws a vine in the target direction, dealing magic damage to the first enemy hit and  rooting them for a short duration, during which they are also  revealed. Rootcaller can be recast while the target is  rooted.","skillTabs":{"0":{"marker":"MAGIC DAMAGE:","content":"80 / 125 / 170 / 215 / 260 (+ 70% AP)"},"1":{"marker":"ROOT DURATION:","content":"1.2 / 1.4 / 1.6 / 1.8 / 2"}}},"1":{"text":"Ivern and allied champions can select the target  rooted by Rootcaller to  dash to their location, with allies stopping at   their attack range and Ivern stopping within   125 range from the target.","skillTabs":{}},"2":{"text":"Recast: Ivern  dashes to the target.","skillTabs":{}}}},"2":{"name":"Brushmaker","metaData":{"0":"TARGET RANGE: 1000","1":"CAST TIME: 0.25","2":"COST: 30 MANA","3":"STATIC COOLDOWN: 0.5","4":"RECHARGE: 40 / 36 / 32 / 28 / 24"},"textContent":{"0":{"text":"Passive: While in Ivern is in  brush, his basic attacks deal bonus magic damage  on-hit. This bonus persists for 3 seconds after leaving brush.","skillTabs":{"0":{"marker":"BONUS MAGIC DAMAGE:","content":"30 / 37.5 / 45 / 52.5 / 60 (+ 30% AP)"}}},"1":{"text":"Active: Ivern grows a patch of  brush at the target location for 30 seconds, granting  sight of the area within and around it for 3 seconds. Brushmaker spawns more brush if used near terrain or other brush.","skillTabs":{}},"2":{"text":"Ivern periodically stocks a Brushmaker charge, up to a maximum of 3.","skillTabs":{}}}},"3":{"name":"Triggerseed","metaData":{"0":"TARGET RANGE: 750","1":"EFFECT RADIUS:  500","2":"CAST TIME: NONE","3":"COST: 70 MANA","4":"COOLDOWN: 11 / 10 / 9 / 8 / 7"},"textContent":{"0":{"text":"Active: Ivern can target an allied champion,  Daisy, or himself to place a  shield for 2 seconds.","skillTabs":{"0":{"marker":"SHIELD:","content":"80 / 115 / 150 / 185 / 220 (+ 75% AP)"}}},"1":{"text":"The target then explodes to deal magic damage and  slow nearby enemies for 2 seconds.","skillTabs":{"0":{"marker":"MAGIC DAMAGE:","content":"70 / 90 / 110 / 130 / 150 (+ 80% AP)"},"1":{"marker":"SLOW:","content":"50 / 55 / 60 / 65 / 70%"}}}}},"4":{"name":"Daisy!","metaData":{"0":"CAST TIME: 0.5","1":"COST: 100 MANA","2":"COOLDOWN: 140 / 130 / 120"},"textContent":{"0":{"text":"Active: Ivern summons his sentinel friend  Daisy to his side, who lands 350 units away from him in the target direction and remains on the field for up to 60 seconds as a controllable  pet.","skillTabs":{}},"1":{"text":"Daisy! can be recast at any time while  Daisy is alive.","skillTabs":{}},"2":{"text":"Recast: Ivern commands  Daisy to move to the target location. If cast on Ivern,  Daisy will follow him.","skillTabs":{}},"3":{"text":"The recast of Daisy! can be used while affected by  cast-inhibiting crowd control. See Pets for more details about  Daisy.","skillTabs":{}}}}}}}}