{"name":"Shyvana","scraped_data":{"baseData":{"baseStats":{"hp":665,"hp_plus":109,"hp5":8.5,"hp5_plus":0.8,"mp":100,"mp_plus":0,"mp5":0,"mp5_plus":0,"ad":66,"ad_plus":3.4,"as":0.658,"as_plus":0.025,"ar":38,"ar_plus":4.55,"mr":32,"mr_plus":2.05,"ms":350,"range":125,"windup":19.737},"abilities":{"0":{"name":"Fury_of_the_Dragonborn","metaData":{},"textContent":{"0":{"text":"Innate: Shyvana gains  5 bonus armor and  5 bonus magic resistance, which is increased by 5 for every   elemental drake and  Elder Dragon her team slays.","skillTabs":{}},"1":{"text":"Additionally, Shyvana deals 20% bonus physical damage and magic damage to Dragons.","skillTabs":{}}}},"1":{"name":"Twin_Bite","metaData":{"0":"CAST TIME: NONE","1":"COOLDOWN: 7 / 6.5 / 6 / 5.5 / 5"},"textContent":{"0":{"text":"Active: Shyvana's next basic attack within 6 seconds gains  25 bonus range, deals 100% AD (+ 35% AP) and causes her to strike again after 0.25 seconds, which deals bonus physical damage and applies  on-hit and on-attack effects at 100% effectiveness.","skillTabs":{"0":{"marker":"BONUS PHYSICAL DAMAGE:","content":"20 / 35 / 50 / 65 / 80% AD (+ 25% AP)"}}},"1":{"text":"Basic attacks  reduce Twin Bite's cooldown by 0.5 seconds  on-hit.","skillTabs":{}},"2":{"text":" Dragon Form Bonus: Shyvana instantly attacks enemies in a cone around the target before applying Twin Bite's effects to each of them. The basic attacks deal 100% AD (+ 35% AP) physical damage, are affected by  critical strike modifiers, and apply  on-hit effects to each target hit. The second strike cannot  critically strike nor trigger on-attack effects, but it will still apply  on-hit effects. Additionally, Twin Bite's empowered attack has an  uncancellable windup.","skillTabs":{}},"3":{"text":"Twin Bite  resets Shyvana's basic attack timer.","skillTabs":{}}}},"2":{"name":"Burnout","metaData":{"0":"EFFECT RADIUS: 162.5 / 350 / 365 / 380","1":"CAST TIME: NONE","2":"COOLDOWN: 12"},"textContent":{"0":{"text":"Active: Shyvana creates a flame aura for 3 seconds, gaining  decaying bonus movement speed and dealing magic damage each 0.5 seconds to nearby enemies.","skillTabs":{"0":{"marker":"BONUS MOVEMENT SPEED:","content":"30 / 35 / 40 / 45 / 50% (+ 8% per 100 AP)"},"1":{"marker":"BONUS MOVEMENT SPEED DECAY:","content":"4.5 / 5.25 / 6 / 6.75 / 7.5%"},"2":{"marker":"MAGIC DAMAGE PER TICK:","content":"10 / 16.25 / 22.5 / 28.75 / 35 (+ 10% bonus AD)"}}},"1":{"text":"During this time, Shyvana's basic attacks deal additional magic damage  on-hit equal to 50% of Burnout's per-tick damage to surrounding enemies and extend the duration of Burnout by 1 second, which can occur up to 4 times for a total 4 seconds.","skillTabs":{"0":{"marker":"MAGIC DAMAGE:","content":"5 / 8.125 / 11.25 / 14.375 / 17.5 (+ 5% bonus AD)"}}},"2":{"text":" Dragon Form Bonus: The aura is enlarged, scaling with  Dragon's Descent's rank.","skillTabs":{}}}},"3":{"name":"Flame_Breath","metaData":{"0":"TARGET RANGE: 925","1":"EFFECT RADIUS:  345","2":"WIDTH:  120","3":"SPEED: 1600 / 1575","4":"CAST TIME: 0.25 / 0.3333","5":"COOLDOWN: 12 / 11 / 10 / 9 / 8"},"textContent":{"0":{"text":"Active: Shyvana unleashes a fireball in the target direction that stops upon hitting an enemy  champion, dealing magic damage to all enemies hit and marking them for 5 seconds.","skillTabs":{"0":{"marker":"MAGIC DAMAGE:","content":"60 / 100 / 140 / 180 / 220 (+ 30% AD) (+ 70% AP)"}}},"1":{"text":"Shyvana's basic attacks against marked enemies deal 3.75% of the target's  maximum health as bonus magic damage  on-hit, capped at 150 against monsters.","skillTabs":{}},"2":{"text":" Dragon Form Bonus: The fireball deals increased magic damage and explodes upon hitting an enemy  champion or reaching the target location, creating a scorched field for 4 seconds. Enemies within the field are marked once and dealt 30 − 60 (based on level) (+ 5% AD) (+ 10% AP) magic damage every 0.5 seconds.","skillTabs":{"0":{"marker":"EMPOWERED MAGIC DAMAGE:","content":"100 − 160 (based on level) +\n60 / 100 / 140 / 180 / 220 (+ 60% AD) (+ 100% AP)"}}},"3":{"text":"Flame Breath while in  Dragon Form will cast at max range if cast beyond that.","skillTabs":{}}}},"4":{"name":"Dragon's_Descent","metaData":{"0":"TARGET RANGE: 850","1":"CAST TIME: 0.25","2":"COST: 2.5 FURY EVERY 0.5 SECONDS"},"textContent":{"0":{"text":"Passive - Fury: Dragon's Descent requires  100 Fury to be cast. Shyvana generates Fury per second while alive and in Human form and 2 Fury per basic attack  on-hit in either form. Shyvana gains 100 Fury upon learning Dragon's Descent.","skillTabs":{"0":{"marker":"FURY GENERATION PER SECOND:","content":"1 / 1.5 / 2"}}},"1":{"text":"Active: Shyvana transforms into Dragon Form and  dashes with  displacement immunity to the target location, dealing magic damage to enemies she passes through and  carrying them alongside her.","skillTabs":{"0":{"marker":"MAGIC DAMAGE:","content":"150 / 250 / 350 (+ 100% AP)"}}},"2":{"text":"Dragon Form: Shyvana gains  bonus health,  bonus attack range, and increased size. Her abilities are also empowered to apply an additional effect. She maintains Dragon Form at a recurring cost of Fury, returning to Human Form once all Fury has been depleted.","skillTabs":{"0":{"marker":"BONUS HEALTH:","content":"150 / 250 / 350"},"1":{"marker":"BONUS RANGE:","content":"50 / 65 / 80"},"2":{"marker":"SIZE INCREASE:","content":"0 / 8.5 / 16%"}}},"3":{"text":"Dragon's Descent will cast at max range if cast beyond that.","skillTabs":{}}}}}}}}