{"scraped_data":{"baseData":{"abilities":{"0":{"name":"Deathbringer_Stance","metaData":{"0":"STATIC COOLDOWN: 24 − 12 (BASED ON LEVEL)"},"textContent":{"0":{"text":"Innate: Aatrox periodically empowers his next basic attack to gain  50 bonus range and deal 5% − 12% (based on level) of the  target's maximum health as bonus physical damage, capped at 100 against  monsters. Aatrox  heals for 100% of the post-mitigation damage dealt, reduced to 25% against  minions.","skillTabs":{}},"1":{"text":"Whenever Aatrox hits at least one enemy  champion or large  monster with a basic attack  on-hit or an ability, the  cooldown of Deathbringer Stance is reduced by 2 seconds, modified to 4 if he hits with the Sweetspot of  The Darkin Blade.","skillTabs":{}}}},"1":{"name":"The_Darkin_Blade","metaData":{"0":"RANGE: VARIED","1":"CAST TIME: 0.6","2":"COOLDOWN: 14 / 12 / 10 / 8 / 6"},"textContent":{"0":{"text":"Active: Aatrox can activate The Darkin Blade three times before the ability goes on cooldown, with a 1 second static cooldown between casts. If Aatrox does not recast the ability within 4 seconds of the previous cast, it goes on cooldown.","skillTabs":{}},"1":{"text":"Aatrox performs a strike with his greatsword for each of the three casts, dealing physical damage to enemies struck within an area. Enemies hit within a Sweetspot of the area are dealt  60% bonus damage and also  knocked up for 0.25 seconds. Each subsequent cast increases The Darkin Blade's damage by 25%.","skillTabs":{}},"2":{"text":"First Cast: Aatrox's first strike affects a 625 × 180-unit rectangular area in the target direction, with him centered on the back line and the Sweetspot at the farthest edge.","skillTabs":{"0":{"marker":"FIRST-CAST DAMAGE:\n»","content":"10 / 30 / 50 / 70 / 90 (+ 60 / 65 / 70 / 75 / 80% AD)"},"1":{"marker":"«First Sweetspot Damage:","content":"16 / 48 / 80 / 112 / 144 (+ 96 / 104 / 112 / 120 / 128% AD)"}}},"3":{"text":"Second Cast: Aatrox's second strike affects a trapezoidal area in the target direction, with the Sweetspot at the farthest edge. The hitbox begins 100-units behind Aatrox and extends 475-units in front of him, measuring between 300 and 500-units wide from behind to in front.","skillTabs":{"0":{"marker":"SECOND-CAST DAMAGE:\n»","content":"12.5 / 37.5 / 62.5 / 87.5 / 112.5 (+ 75 / 81.25 / 87.5 / 93.75 / 100% AD)"},"1":{"marker":"«Second Sweetspot Damage:","content":"20 / 60 / 100 / 140 / 180 (+ 120 / 130 / 140 / 150 / 160% AD)"}}},"4":{"text":"Third Cast: Aatrox's third strike affects a 300-radius circular area centered on a target location that is 200 units in front of him, with a 180-radius Sweetspot within.","skillTabs":{"0":{"marker":"THIRD-CAST DAMAGE:\n»","content":"15 / 45 / 75 / 105 / 135 (+ 90 / 97.5 / 105 / 112.5 / 120% AD)"},"1":{"marker":"«Third Sweetspot Damage:","content":"24 / 72 / 120 / 168 / 216 (+ 144 / 156 / 168 / 180 / 192% AD)"}}},"5":{"text":"The Darkin Blade deals 55% damage against  minions, and the  knock up duration from hitting the Sweetspot is doubled to 0.5 seconds against  monsters.","skillTabs":{"0":{"marker":"MAXIMUM NON-MINION DAMAGE:","content":"60 / 180 / 300 / 420 / 540 (+ 360 / 390 / 420 / 450 / 480% AD)"}}}}},"2":{"name":"Infernal_Chains","metaData":{"0":"RANGE:  825 /  765","1":"WIDTH:  160","2":"SPEED: 1800","3":"CAST TIME: 0.25","4":"COOLDOWN: 20 / 18.5 / 17 / 15.5 / 14"},"textContent":{"0":{"text":"Active: Aatrox sends a chain in the target direction that deals physical damage to the first enemy hit, doubled against  minions, and  slowing them by 25% for 1.5 seconds.","skillTabs":{"0":{"marker":"PHYSICAL DAMAGE:\n»","content":"30 / 40 / 50 / 60 / 70 (+ 40% AD)"},"1":{"marker":"«Minion Damage:","content":"60 / 80 / 100 / 120 / 140 (+ 80% AD)"}}},"1":{"text":"If Infernal Chains hits an enemy  champion or large  monster, a  tether is formed between a source within the impact area and the target for 1.5 seconds, during which the target is  revealed.","skillTabs":{}},"2":{"text":"If the tether is not broken by the end of its duration, the target is dealt the same physical damage again and  pulled to the center of the area.","skillTabs":{"0":{"marker":"TOTAL DAMAGE:","content":"60 / 80 / 100 / 120 / 140 (+ 80% AD)"}}}}},"3":{"name":"Umbral_Dash","metaData":{"0":"TARGET RANGE: 75 / 300 / 500","1":"SPEED: 800 / UP TO 1340","2":"CAST TIME: NONE","3":"COOLDOWN: 9 / 8 / 7 / 6 / 5"},"textContent":{"0":{"text":"Passive: Aatrox  heals for a percentage of the non- persistent post-mitigation damage he deals against enemy champions, increased during  World Ender.","skillTabs":{"0":{"marker":"HEALING:\n»","content":"18 / 20 / 22 / 24 / 26%"},"1":{"marker":"« World Ender Increased Healing:","content":"25 / 30 / 35 / 40 / 45%"}}},"1":{"text":"Active: Aatrox  dashes in the target direction.","skillTabs":{}},"2":{"text":"Umbral Dash  resets Aatrox's basic attack timer and can be cast during his other abilities without cancelling them and vice versa.","skillTabs":{}}}},"4":{"name":"World_Ender","metaData":{"0":"EFFECT RADIUS: 600","1":"CAST TIME: 0.25","2":"COOLDOWN: 120 / 100 / 80"},"textContent":{"0":{"text":"Active: Aatrox unleashes his true demonic form,  fearing nearby enemy  minions and  monsters for 3 seconds, during which they are gradually  slowed by up to 99% over the duration. For the next 10 seconds, Aatrox gains  ghosting and  bonus movement speed, decaying by 10% of the current bonus every 0.25 seconds.","skillTabs":{"0":{"marker":"BONUS MOVEMENT SPEED:","content":"60 / 80 / 100%"}}},"1":{"text":"While transformed, Aatrox gains  bonus attack damage and 5% increased size, and receives increased  self-healing from all sources.","skillTabs":{"0":{"marker":"BONUS AD:","content":"20 / 30 / 40% AD"},"1":{"marker":"INCREASED HEALING:","content":"25 / 40 / 55%"}}},"2":{"text":"Scoring a champion  takedown extends World Ender's duration by 5 seconds, refreshing its effects up to the original amount.","skillTabs":{}}}}},"baseStats":{"windup":"19.737% "}}}}