{"scraped_data":{"baseData":{"abilities":{"0":{"name":"Way_of_the_Wanderer","metaData":{},"textContent":{"0":{"text":"Innate - Intent: Yasuo's  total critical strike chance is multiplied by 2.5 from all other sources, but his  critical strikes deal only「 (57.5% +  31.5%) AD bonus physical damage. 」「 90% of the normal  critical strike damage. 」Additionally,「 every 1% critical strike chance in excess of 100% is converted into 0.4 bonus AD. 」「 every 50% critical strike chance in excess of 100% is converted into 20 bonus AD. 」","skillTabs":{}},"1":{"text":"Innate - Resolve: Yasuo generates  Flow for every 59 / 52.5 / 46 (based on level) units he travels by any means. At「 100 stacks 」「 5900 / 5250 / 4600 (based on level) units traveled 」and upon taking damage from an enemy  champion or  monster, Yasuo consumes all  Flow to  shield himself for 100 − 475 (based on level) for up to 1 second.","skillTabs":{}}}},"1":{"name":"Steel_Tempest","metaData":{"0":"RANGE:  450 /  1150","1":"EFFECT RADIUS:  215","2":"WIDTH:  80 /  180","3":"SPEED: 1200","4":"CAST TIME: 0.4 − 0.133 (BASED ON BONUS ATTACK SPEED)","5":"STATIC COOLDOWN: 4 − 1.33 (BASED ON BONUS ATTACK SPEED)"},"textContent":{"0":{"text":"Active: Yasuo thrusts his sword in a line in the target direction that deals physical damage to enemies hit and applies  on-hit and on-attack effects at 100% effectiveness to the first enemy hit. Steel Tempest's damage can  critically strike for「 (47% +  29.4%) AD bonus physical damage. 」「 84% of the  critical damage champions usually have. 」","skillTabs":{"0":{"marker":"PHYSICAL DAMAGE:","content":"20 / 45 / 70 / 95 / 120 (+ 105% AD)"}}},"1":{"text":"If this hits at least one enemy, Yasuo generates a stack of Gathering Storm for 6 seconds, which refreshes on subsequent hits. At 2 stacks, the next Steel Tempest consumes them all to become empowered with a new effect.","skillTabs":{}},"2":{"text":"Gathering Storm Bonus: Yasuo unleashes a whirlwind in the target direction that deals the same damage to enemies hit and  knocks them up for 0.75 seconds, or 0.9 seconds in combination with  Sweeping Blade.","skillTabs":{}},"3":{"text":"Steel Tempest's thrust is  interrupted if Yasuo is affected by  disarming crowd control during the cast time, but its cooldown is  reset to 0.1 seconds.","skillTabs":{}},"4":{"text":"If Steel Tempest is cast during  Sweeping Blade, it will instead affect enemies around Yasuo at the end of the dash, or doing so immediately at his landing location after  blinking while ending the dash prematurely.","skillTabs":{}},"5":{"text":"Casting  Sweeping Blade when Steel Tempest's remaining cooldown is less than 0.5 seconds resets this remaining cooldown to allow casting it in combination, but adds the refunded time to the cooldown of that cast. If Yasuo becomes unable to cast abilities during the dash after buffering, Steel Tempest will not cast, but will still go on cooldown.(bug)","skillTabs":{}}}},"2":{"name":"Wind_Wall","metaData":{"0":"RANGE: 0 - 350 / 450","1":"EFFECT RADIUS: 300","2":"CAST TIME: 0.013","3":"COOLDOWN: 30 / 27 / 24 / 21 / 18"},"textContent":{"0":{"text":"Active: Yasuo raises a wall of wind that travels in the target direction over 0.25 seconds. It then drifts another 50 units over 3.75 seconds, blocking all hostile non- turret  projectiles that hit it and granting  sight of its surroundings.","skillTabs":{"0":{"marker":"WALL WIDTH:","content":"320 / 390 / 460 / 530 / 600"}}}}},"3":{"name":"Sweeping_Blade","metaData":{"0":"TARGET RANGE:  475","1":"RANGE: 475 / 625","2":"SPEED: 750 + 60% MOVEMENT SPEED","3":"COOLDOWN: 0.5 / 0.4 / 0.3 / 0.2 / 0.1","4":"TARGET IMMUNITY: 10 / 9 / 8 / 7 / 6"},"textContent":{"0":{"text":"Active: Yasuo  dashes a fixed distance in the direction of the target enemy. Upon impact, he deals them magic damage, becomes  ghosted for 2 seconds, and generates a stack of Ride the Wind for 5 seconds, which refreshes on subsequent hits and stacks up to 2 times.","skillTabs":{"0":{"marker":"MAGIC DAMAGE:","content":"60 / 70 / 80 / 90 / 100 (+ 20% bonus AD) (+ 60% AP)"}}},"1":{"text":"Ride the Wind: For each stack, Sweeping Blade's base damage is increased by 25%, up to a 50% increase.","skillTabs":{"0":{"marker":"BONUS DAMAGE:\n»","content":"15 / 17.5 / 20 / 22.5 / 25"},"1":{"marker":"«Maximum Bonus Damage:»","content":"30 / 35 / 40 / 45 / 50"},"2":{"marker":"«Total Damage:","content":"90 / 105 / 120 / 135 / 150 (+ 20% bonus AD) (+ 60% AP)"}}},"2":{"text":"Sweeping Blade can be cast on the same target only once every few seconds.","skillTabs":{}},"3":{"text":"Yasuo will be  knocked down by any  immobilizing or  polymorphing crowd control, excluding  sleep(bug), during Sweeping Blade.","skillTabs":{}},"4":{"text":" Last Breath can be cast during the dash. If  Steel Tempest has been buffered,  Wind Wall may also be cast during it. (bug)","skillTabs":{}}}},"4":{"name":"Last_Breath","metaData":{"0":"TARGET RANGE: 1400","1":"EFFECT RADIUS: 400","2":"CAST TIME: NONE","3":"COOLDOWN: 70 / 50 / 30"},"textContent":{"0":{"text":"Active: Yasuo  blinks to the other side of a  visible  airborne enemy champion nearest to the cursor, instantly generating maximum  Flow while resetting  Gathering Storm stacks.","skillTabs":{}},"1":{"text":"Upon arrival, he  knocks up all nearby  airborne enemy champions for 1 second,  revealing them and slashing them with his sword over the duration, dealing physical damage thereafter. Surrounding enemy champions that become  airborne during this time will also be affected by Last Breath through the remaining duration.","skillTabs":{"0":{"marker":"PHYSICAL DAMAGE:","content":"200 / 350 / 500 (+ 150% bonus AD)"}}},"2":{"text":"For the next 15 seconds, Yasuo's  critical strikes gain  50% bonus-armor penetration.","skillTabs":{}},"3":{"text":"A nearby  airborne enemy champion is required to cast this ability. If Yasuo would blink inside the  attack range of an enemy  turret (excluding the  Nexus Obelisk), Last Breath will instead attempt to position him outside of it.","skillTabs":{}}}}},"baseStats":{"windup":"22% "}}}}